tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
bool IrrigationApp::readWateringRecordStoreStatus(
    Esp32BaseRecordStore::StoreStatus& status) const {
    return wateringRecordStore_.readStatus(status);
}

bool IrrigationApp::recordStorageFault() const {
    return recordStorageFault_;
}

bool IrrigationApp::eventStorageFault() const {
    return eventStorageFault_;
}

bool IrrigationApp::schedulerStorageFault() const {
    return schedulerStorageFault_;
}

bool IrrigationApp::checkpointStorageFault() const {
    return aliveCheckpoint_.storageFault();
}

uint32_t IrrigationApp::lastKnownAliveEpoch() const {
    return aliveCheckpoint_.lastKnownAliveEpoch();
}

bool IrrigationApp::unexpectedFlowAlarm() const {
    return unexpectedFlowMonitor_.alarmActive();
}

AutomaticWateringState IrrigationApp::automaticWateringState() const {
    return wateringScheduler_.automaticState();
}

WateringScheduler::TimeState IrrigationApp::schedulerTimeState() const {
    return wateringScheduler_.timeState();
}

bool IrrigationApp::pauseAutomaticWateringIndefinitely() {
    return businessReady_ && wateringScheduler_.pauseIndefinitely();
}

bool IrrigationApp::pauseAutomaticWateringUntil(uint32_t resumeAtEpoch) {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return businessReady_ && wateringScheduler_.pauseUntil(resumeAtEpoch,
                                                           now.synced,
                                                           now.epochSec);
}

bool IrrigationApp::resumeAutomaticWatering() {
    return businessReady_ && wateringScheduler_.resumeManually();
}

WateringStartResult IrrigationApp::startFlowCalibration(
    uint8_t zoneId,
    uint16_t maximumDurationMinutes) {
    if (flowCalibrationService_.hasPendingMeasurement() ||
        !BoardPins::isValidZoneId(zoneId) || maximumDurationMinutes == 0 ||
        maximumDurationMinutes > 60) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::FlowCalibration;
    request.stepCount = 1;
    request.steps[0] = {zoneId, static_cast<uint32_t>(maximumDurationMinutes) * 60U};
    return startWatering(request);
}

bool IrrigationApp::submitFlowCalibrationMeasurement(uint32_t measuredWaterMl) {
    return businessReady_ && flowCalibrationService_.addPendingMeasurement(measuredWaterMl);
}

bool IrrigationApp::saveFlowCalibration(uint32_t expectedConfigRevision) {
    const uint32_t coefficient = flowCalibrationService_.combinedPulsesPerLiterX100();
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current || coefficient == 0) {
        return false;
    }
    IrrigationConfig next = *current;
    next.flowMeter.pulsesPerLiterX100 = coefficient;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    if (!IrrigationEvents::appendSchedulerEvent(
            static_cast<uint32_t>(IrrigationEvents::EventCode::FlowCalibrationSaved),
            IrrigationEvents::ReasonCode::CalibrationCoefficientSaved,
            0,
            coefficient > static_cast<uint32_t>(INT32_MAX)
                ? INT32_MAX
                : static_cast<int32_t>(coefficient),
            Esp32BaseAppEvents::Level::Info)) {
        eventStorageFault_ = true;
    }
    flowCalibrationService_.clear();
    return true;
}

void IrrigationApp::resetFlowCalibration() {
    if (!wateringController_.status().active) {
        flowCalibrationService_.clear();
    }
}

const FlowCalibrationService& IrrigationApp::flowCalibration() const {
    return flowCalibrationService_;
}

WateringStartResult IrrigationApp::startZoneFlowLearning(uint8_t zoneId) {
    if (pendingLearnedZoneId_ != 0 || !BoardPins::isValidZoneId(zoneId)) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::ZoneFlowLearning;
    request.stepCount = 1;
    request.steps[0] = {zoneId, 10U * 60U};
    return startWatering(request);
}

bool IrrigationApp::saveLearnedZoneFlow(uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current ||
        !BoardPins::isValidZoneId(pendingLearnedZoneId_) ||
        pendingLearnedFlowMlPerMinute_ == 0) {
        return false;
    }
    IrrigationConfig next = *current;
    next.zones[BoardPins::zoneIndex(pendingLearnedZoneId_)].learnedFlowMlPerMinute =
        pendingLearnedFlowMlPerMinute_;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    if (!IrrigationEvents::appendSchedulerEvent(
            static_cast<uint32_t>(IrrigationEvents::EventCode::ZoneFlowLearned),
            IrrigationEvents::ReasonCode::ZoneFlowLearned,
            pendingLearnedZoneId_,
            pendingLearnedFlowMlPerMinute_ > static_cast<uint32_t>(INT32_MAX)
                ? INT32_MAX
                : static_cast<int32_t>(pendingLearnedFlowMlPerMinute_),
            Esp32BaseAppEvents::Level::Info)) {
        eventStorageFault_ = true;
    }
    discardLearnedZoneFlow();
    return true;
}

uint8_t IrrigationApp::pendingLearnedZoneId() const {
    return pendingLearnedZoneId_;
}

uint32_t IrrigationApp::pendingLearnedFlowMlPerMinute() const {
    return pendingLearnedFlowMlPerMinute_;
}

void IrrigationApp::discardLearnedZoneFlow() {
    if (!wateringController_.status().active) {
        pendingLearnedZoneId_ = 0;
        pendingLearnedFlowMlPerMinute_ = 0;
    }
}

const IrrigationConfig* IrrigationApp::configuration() const {
    return configStore_.current();
}

bool IrrigationApp::saveConfiguration(const IrrigationConfig& proposed,
                                      uint32_t expectedRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || !current) {
        return false;
    }
    BoardHardware& hardware = BoardHardware::instance();
    const bool active = wateringController_.status().active;
    const bool frequencyChanged = proposed.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    bool hardwareChanged = false;
    if (frequencyChanged && !active) {
        if (!hardware.configureValvePwmFrequency(proposed.valveDrive.pwmFrequencyHz)) {
            return false;
        }
        hardwareChanged = true;
    }
    const uint32_t previousFrequency = current->valveDrive.pwmFrequencyHz;
    if (!configStore_.save(proposed, expectedRevision)) {
        if (hardwareChanged && !hardware.configureValvePwmFrequency(previousFrequency)) {
            businessReady_ = false;
            hardware.safeShutdown();
        }
        return false;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) {
        resetUnexpectedFlowMonitor(millis());
    }
    if (!IrrigationEvents::appendSchedulerEvent(
            static_cast<uint32_t>(IrrigationEvents::EventCode::ConfigurationChanged),
            IrrigationEvents::ReasonCode::ConfigurationSaved,
            0,
            static_cast<int32_t>(configStore_.current()->revision),
            Esp32BaseAppEvents::Level::Info)) {
        eventStorageFault_ = true;
    }
    return true;
}

const char* IrrigationApp::configurationError() const {
    return configStore_.lastError();
}

void IrrigationApp::advanceBusiness() {
    if (!businessReady_) {
        BoardHardware::instance().safeShutdown();
        return;
    }
    const uint32_t nowMs = millis();
    wateringController_.handle(nowMs);
    consumeFinishedWatering();
    const IrrigationConfig* config = configStore_.current();
    if (config && !wateringController_.status().active) {
        const UnexpectedFlowMonitor::Update update = unexpectedFlowMonitor_.observe(
            nowMs, BoardHardware::instance().flowPulseCount());
        if (update == UnexpectedFlowMonitor::Update::AlarmRaised &&
            !IrrigationEvents::appendSchedulerEvent(
                static_cast<uint32_t>(IrrigationEvents::EventCode::UnexpectedFlowDetected),
                IrrigationEvents::ReasonCode::UnexpectedFlow,
                0,
                unexpectedFlowMonitor_.observedPulseCount() > static_cast<uint32_t>(INT32_MAX)
                    ? INT32_MAX
                    : static_cast<int32_t>(unexpectedFlowMonitor_.observedPulseCount()),
                Esp32BaseAppEvents::Level::Warning)) {
            eventStorageFault_ = true;
        }
    }
    if (config) {
        const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
        if (wateringScheduler_.storageReady()) {
            wateringScheduler_.handle(*config,
                                      now.synced,
                                      now.source == Esp32BaseTime::SOURCE_NTP,
                                      now.epochSec);
        }
        Esp32BaseRecordStore::StoreStatus recordStatus{};
        Esp32BaseAppEvents::EventStoreStatus eventStatus{};
        if (wateringRecordStore_.readStatus(recordStatus) &&
            Esp32BaseAppEvents::readStatus(eventStatus)) {
            const uint64_t activitySequence =
                (static_cast<uint64_t>(recordStatus.nextRecordId) << 32U) |
                eventStatus.storage.nextRecordId;
            aliveCheckpoint_.handle(now,
                                    config->timeSafety.aliveCheckpointHours,
                                    wateringController_.status().active,
                                    activitySequence);
        }
    }
}

void IrrigationApp::consumeFinishedWatering() {
    const WateringSessionSummary* summary = wateringController_.finishedSession();
    if (!summary) {
        return;
    }

    if (summary->purpose == WateringPurpose::FlowCalibration) {
        flowCalibrationService_.captureFinishedSession(*summary);
    } else if (summary->purpose == WateringPurpose::ZoneFlowLearning &&
               summary->zoneCount == 1 &&
               summary->zones[0].suggestedFlowMlPerMinute != 0) {
        pendingLearnedZoneId_ = summary->zones[0].zoneId;
        pendingLearnedFlowMlPerMinute_ = summary->zones[0].suggestedFlowMlPerMinute;
    }

    if (summary->purpose == WateringPurpose::Normal && summary->anyFlowEstablished) {
        if (!wateringStartTimeValid_ ||
            !wateringRecordStore_.appendCompleted(wateringStartTime_, *summary)) {
            recordStorageFault_ = true;
            reportRecordStorageFault(wateringStartTimeValid_
                                         ? IrrigationEvents::ReasonCode::RecordAppendFailed
                                         : IrrigationEvents::ReasonCode::RecordStartTimeUnavailable);
        } else {
            recordStorageFault_ = wateringRecordStore_.state() !=
                                  Esp32BaseRecordStore::StoreState::Ready;
        }
    }

    if (!IrrigationEvents::appendAbnormalWateringStop(*summary)) {
        eventStorageFault_ = true;
    }
    if (!IrrigationEvents::appendFlowDeviationEvents(*summary)) {
        eventStorageFault_ = true;
    }
    resetUnexpectedFlowMonitor(millis());
    applyPendingHardwareConfiguration();
    wateringController_.clearFinishedSession();
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
}

void IrrigationApp::applyPendingHardwareConfiguration() {
    if (!pendingPwmReconfigure_ || wateringController_.status().active) {
        return;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config || !BoardHardware::instance().configureValvePwmFrequency(
                       config->valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = false;
}

void IrrigationApp::resetUnexpectedFlowMonitor(uint32_t nowMs) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return;
    }
    unexpectedFlowMonitor_.begin(
        nowMs,
        BoardHardware::instance().flowPulseCount(),
        config->flowProtection.unexpectedFlowDelaySec,
        config->flowProtection.unexpectedFlowWindowSec,
        config->flowProtection.unexpectedFlowPulseCount);
}

void IrrigationApp::reportRecordStorageFault(IrrigationEvents::ReasonCode operation) {
    if (!IrrigationEvents::appendRecordStorageFault(operation,
                                                    wateringRecordStore_.state(),
                                                    wateringRecordStore_.lastError())) {
        eventStorageFault_ = true;
    }
}

WateringStartResult IrrigationApp::startScheduledWatering(const WateringRequest& request,
                                                          void* user) {
    return user ? static_cast<IrrigationApp*>(user)->startWatering(request)
                : WateringStartResult::NotReady;
}

void IrrigationApp::handleSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t value,
                                         void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->reportSchedulerEvent(event, planId, value);
    }
}

void IrrigationApp::reportSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t value) {
    IrrigationEvents::EventCode eventCode = IrrigationEvents::EventCode::AutomaticWateringStateChanged;
    IrrigationEvents::ReasonCode reason = IrrigationEvents::ReasonCode::PausedIndefinitely;
    Esp32BaseAppEvents::Level level = Esp32BaseAppEvents::Level::Info;
    switch (event) {
        case WateringScheduler::Event::PausedIndefinitely:
            reason = IrrigationEvents::ReasonCode::PausedIndefinitely;
            break;
        case WateringScheduler::Event::PausedUntil:
            reason = IrrigationEvents::ReasonCode::PausedUntil;
            break;
        case WateringScheduler::Event::ResumedManually:
            reason = IrrigationEvents::ReasonCode::ResumedManually;
            break;
        case WateringScheduler::Event::ResumedAutomatically:
            reason = IrrigationEvents::ReasonCode::ResumedAutomatically;
            break;
        case WateringScheduler::Event::PlanSkippedBusy:
            eventCode = IrrigationEvents::EventCode::AutomaticPlanSkipped;
            reason = IrrigationEvents::ReasonCode::PlanBusy;
            level = Esp32BaseAppEvents::Level::Warning;
            break;
        case WateringScheduler::Event::PlanStartRejected:
            eventCode = IrrigationEvents::EventCode::AutomaticPlanSkipped;
            reason = IrrigationEvents::ReasonCode::PlanStartRejected;
            level = Esp32BaseAppEvents::Level::Warning;
            break;
        case WateringScheduler::Event::StorageFault:
            schedulerStorageFault_ = true;
            eventCode = IrrigationEvents::EventCode::SchedulerStorageFault;
            reason = IrrigationEvents::ReasonCode::SchedulerStateStorage;
            level = Esp32BaseAppEvents::Level::Error;
            break;
        case WateringScheduler::Event::RtcRollbackDetected:
            eventCode = IrrigationEvents::EventCode::RtcRollbackDetected;
            reason = IrrigationEvents::ReasonCode::RtcRollback;
            level = Esp32BaseAppEvents::Level::Warning;
            break;
    }
    if (!IrrigationEvents::appendSchedulerEvent(static_cast<uint32_t>(eventCode),
                                                reason,
                                                planId,
                                                value,
                                                level)) {
        eventStorageFault_ = true;
    }
}

